Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_TOP
"Top"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_RIGHT
"Right"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_BOTTOM
"Bottom"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_LEFT
"Left"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_CENTER_Y
"Center Y"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_CENTER_X
"Center X"

Autodesk.Revit.DB.BuiltInParameter.PLACEMENT_PARAMS_SHOW
"Enable Position Parameters"

Autodesk.Revit.DB.BuiltInParameter.EXCHANGE_ENTITY_ID
"Exchange Entity ID"

Autodesk.Revit.DB.BuiltInParameter.EXCHANGE_ID
"Exchange ID"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_DETAIL_LEVEL
"Detail Level"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_ANGULAR_DIMENSION_TEXT_POSITION
"Angle Text Position"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_SEGMENT_LENGTH_DIMENSION_TEXT_POSITION
"Dimension Text Position"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_SEGMENET_REPESENTATION
"Representation"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_VARYING_REBAR_DIMENSION
"Varying Rebar Set Dimensions"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_REPESENTATION_FOR_3D_BARS
"View for 3D Shape"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ANGULAR_DIMENSIONS_MEASUREMENT
"Angle Measurement"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ANGULAR_DIMENSIONS_FOR_HOOKS_ENABLED
"Hook Angles"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_BEND_DIAMETER_DIMENSIONS_FOR_HOOKS_ENABLED
"Hook Bends"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_BEND_DIAMETER_DIMENSIONS_FOR_SEGMENTS_ENABLED
"Segment Bends"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SHOW_BAR_BENDING_USING
"Dimension Type"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_DIAMETER_DIMENSION_TYPE_ID
"Diameter Dimension Style"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_RADIAL_DIMENSION_TYPE_ID
"Radial Dimension Style"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_BEND_DIAMETER_DIMENSIONS_ENABLED
"Bend Diameter Dimensions"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ANGULAR_DIMENSION_OFFSET
"Angular Dimension Offset"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SHOW_ANGULAR_DIMENSIONS_FOR
"Show for Angles"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ANGULAR_DIMENSION_TYPE_ID
"Angular Dimension Style"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ANGULAR_DIMENSIONS_ENABLED
"Angular Dimensions"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_ORTHOGONAL_AND_OVERALL_DIMESIONS_ENABLED
"Other Dimensions"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTH_DIMENSIONS_FOR_HOOKS_ENABLED
"Hook Lengths"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTH_DIMENSIONS_OFFSET
"Dimension Offset"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTHS_DISPLAY_OPTION
"Straight Segment Lengths"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTHS_FOR_ARCS_DISPLAY_OPTION
"Arc Segment Lengths"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTH_DIMENSION_TYPE_ID
"Linear Dimension Style"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SEGMENT_LENGTH_DIMENSIONS_ENABLED
"Segment Length Dimensions"

Autodesk.Revit.DB.BuiltInParameter.LOAD_IS_CONSTRAINED_ON_HOST
"Is constrained on host"

Autodesk.Revit.DB.BuiltInParameter.REBAR_ALIGNMENT_OPTIONS
"Bar Alignment"

Autodesk.Revit.DB.BuiltInParameter.SCHEDULE_ROW_HEIGHT_INPUT
"Row Height"

Autodesk.Revit.DB.BuiltInParameter.SCHEDULE_RESIZE_ROWS
"Resize Rows"

Autodesk.Revit.DB.BuiltInParameter.SCHEDULE_ROTATION_ON_SHEET
"Rotation on Sheet"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_SCHEDULE_FAMILY
"Family"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_IS_VARIABLE
"Is Variable"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_IS_STRUCTURAL_MATERIAL
"Is Structural Material"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_IS_CORE_LAYER
"Is Core Layer"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_COMPOUND_ELEM_TYPE
"Compound Element Type"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_COMPOUND_ELEM_FAMILY
"Compound Element Family"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_ElEVATION_BASE_TYPE
"Elevation Base Type"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_ElEVATION
"Elevation"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_OFFSET_FROM_SURFACE
"Offset from Surface"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_BASETYPE_ENUM
"Point Base Type"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_CONTOUR_SUBCATEGORY_ID
"Subcategory"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_CONTOUR_DISPLAY_SETTINGS_ID_PARAM
"Contour Display"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_SUBDIVIDE_MATERIAL
"Material"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_SUBDIVIDE_HEIGNT
"Sub-divide Height"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_INHERIT_CONTOURS
"Inherit Contours"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_FUNCTION_PARAM
"Function"

Autodesk.Revit.DB.BuiltInParameter.PREFER_PATTERN_ALIGN_UI_FILTER
"Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_ELEVATION_AT_TOP
"Elevation at Top"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_ELEVATION_AT_BOTTOM
"Elevation at Bottom"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_STRUCTURE_ID_PARAM
"Structure"

Autodesk.Revit.DB.BuiltInParameter.LOWEST_ASSOCIATED_LEVEL
"Lowest Associated Level": The lowest level associated with this Analytical Element.

Autodesk.Revit.DB.BuiltInParameter.HIGHEST_ASSOCIATED_LEVEL
"Highest Associated Level": The highest level associated with this Analytical Element.

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_HEIGHTABOVELEVEL_PARAM
"Height Offset From Level"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_ATTR_THICKNESS_PARAM
"Thickness"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_TYPE_DEFAULT_THICKNESS_PARAM
"Default Thickness"

Autodesk.Revit.DB.BuiltInParameter.OFFSET_FROM_REFERENCE_BASE
"Offset from Reference Base"

Autodesk.Revit.DB.BuiltInParameter.REFERENCE_BASE_ON_HOST
"Reference Base on Host"

Autodesk.Revit.DB.BuiltInParameter.OVAL_FRAMING_HEIGHT
"Oval Height"

Autodesk.Revit.DB.BuiltInParameter.OVAL_FRAMING_WIDTH
"Oval Width"

Autodesk.Revit.DB.BuiltInParameter.CIRCULAR_FRAMING_DIAMETER
"Circular Diameter"

Autodesk.Revit.DB.BuiltInParameter.LINEAR_FRAMING_LENGTH
"Length"

Autodesk.Revit.DB.BuiltInParameter.FRAMING_SHAPE_CLASSIFICATION
"Framing Shape"

Autodesk.Revit.DB.BuiltInParameter.STIFFENER_CLASSIFICATION
"Classification"

Autodesk.Revit.DB.BuiltInParameter.FAMILY_SELF_ORIENTING
"Align to View"

Autodesk.Revit.DB.BuiltInParameter.COUPLER_ROTATION_ANGLE
"Coupler Rotation"

Autodesk.Revit.DB.BuiltInParameter.PREFER_DIM_SIDE_UI_FILTER
"Prefer:": This is used by the UI to allow select prefer dimension side.

Autodesk.Revit.DB.BuiltInParameter.MULTIPLE_ALIGNMENT_UI_TOGGLE
"Multiple Alignment": This is used by the UI to allow selection of multiple elements.

Autodesk.Revit.DB.BuiltInParameter.LOCK_ALIGNMENT_UI_TOGGLE
"Lock": This is used by the UI to allow selection of lock alignment.

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_BASE_EXTENSION_DIS
"Base Extension Distance"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_TOP_EXTENSION_DIS
"Top Extension Distance"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_FUNCTION
"Function": Function

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_MATERIALS
"Material": Material

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_THICKNESS
"Thickness": Thickness

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_AREA_COMPUTED
"Area"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_OFFSET_FROM_HOST
"Offset From Host"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_VOLUME_COMPUTED
"Volume"

Autodesk.Revit.DB.BuiltInParameter.LAYER_TYPE_MATERIALS
"Material": Material

Autodesk.Revit.DB.BuiltInParameter.LAYER_TYPE_THICKNESS
"Thickness": Thickness

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_BASE_CONSTRAINT
"Base Constraint"

Autodesk.Revit.DB.BuiltInParameter.LAYER_ELEM_TOP_CONSTRAINT
"Top Constraint"

Autodesk.Revit.DB.BuiltInParameter.REBAR_INSTANCE_BAR_MODEL_DIAMETER
"Model Bar Diameter"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MODEL_BAR_DIAMETER
"Model Bar Diameter"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SHOW_GRIDS
"Show Grids"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MODIFIED_SET
"Modified Rebar Set"

Autodesk.Revit.DB.BuiltInParameter.MOVES_WITH_GRID_PARAM
"Moves With Grids": Disable attachment from grids.

Autodesk.Revit.DB.BuiltInParameter.DPART_LAYER_INDEX
"Layer Index"

Autodesk.Revit.DB.BuiltInParameter.VOID_CUTS_GEOMETRY
"Cuts Geometry"

Autodesk.Revit.DB.BuiltInParameter.REBAR_HOOK_ROTATION_AT_END_SCHEDULES_TAGS_FILTERS
"Hook Rotation At End"

Autodesk.Revit.DB.BuiltInParameter.REBAR_HOOK_ROTATION_AT_START_SCHEDULES_TAGS_FILTERS
"Hook Rotation At Start"

Autodesk.Revit.DB.BuiltInParameter.REBAR_HOOK_LENGTH_OVERRIDE
"Override Hook Lengths"

Autodesk.Revit.DB.BuiltInParameter.INFRASTRUCTURE_ALIGNMENT_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.INFRASTRUCTURE_ALIGNMENT_DESCRIPTION
"Description"

Autodesk.Revit.DB.BuiltInParameter.INFRASTRUCTURE_ALIGNMENT_DISPLAYED_START_STATION
"Displayed Start Station"

Autodesk.Revit.DB.BuiltInParameter.INFRASTRUCTURE_ALIGNMENT_DISPLAYED_END_STATION
"Displayed End Station"

Autodesk.Revit.DB.BuiltInParameter.ASSEMBLY_PRECAST_FREEZE
"Disable Precast Updates"

Autodesk.Revit.DB.BuiltInParameter.REBAR_HOOK_ROTATION_AT_END
"Hook Rotation At End"

Autodesk.Revit.DB.BuiltInParameter.REBAR_HOOK_ROTATION_AT_START
"Hook Rotation At Start"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SHAPE_HOOK_ROTATION_AT_END
"Hook Rotation At End"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SHAPE_HOOK_ROTATION_AT_START
"Hook Rotation At Start"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_FROM_ROOM
"From Room"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_TO_ROOM
"To Room"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_TOTAL_COINCIDENT_LOAD
"Total Coincident Loads"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_NUMBER_OF_CIRCUITS
"Max Number of Circuits"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PROFILE_VOLUME
"Volume"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PROFILE_LENGTH
"Length"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PROFILE_TYPE
"Profile Type"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_EDIT_CIRCUIT_NAMING_SETTINGS_PARAM
"Circuit Naming Settings"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_JUSTIFICATION
"Justification"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_PAINT_AREA
"Paint Area"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_EXACT_WEIGHT
"Exact Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_WEIGHT
"Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_VOLUME
"Volume"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_AREA
"Area"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_WIDTH
"Width"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_LENGTH
"Length"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PLATE_TYPE
"Type"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_TOTAL_WEIGHT
"Total Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_SHEARSTUD_TOTAL_WEIGHT
"Total Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_ANCHOR_TOTAL_WEIGHT
"Total Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_ANCHOR_ORIENTATION
"Anchor Orientation"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_CUT_LENGTH
"Cut Length"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_EXACT_WEIGHT
"Exact Weight"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_PAINT_AREA
"Paint Area"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_WEIGHT
"Weight"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_SPEED
"Speed"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_LOCATION
"Location"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_FINISH_CALCULATION_AT_GAP
"Finish Calculation At Gap"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_INVERTED
"Inverted"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_GRIP_LENGTH_INCREASE
"Grip Length Increase"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_GRIP_LENGTH
"Grip Length"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_BOLT_LENGTH
"Bolt Length"

Autodesk.Revit.DB.BuiltInParameter.GENERIC_ZONE_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.RBS_PIPE_BOTTOM_ELEVATION
"Lower End Bottom Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_PIPE_TOP_ELEVATION
"Upper End Top Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_CURRENT_PHASEC
"Feed Through Lugs Current Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_CURRENT_PHASEB
"Feed Through Lugs Current Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_CURRENT_PHASEA
"Feed Through Lugs Current Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEC
"Feed Through Lugs Apparent Load Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEB
"Feed Through Lugs Apparent Load Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEA
"Feed Through Lugs Apparent Load Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_CURRENT_PHASEC
"Branch Circuit Current Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_CURRENT_PHASEB
"Branch Circuit Current Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_CURRENT_PHASEA
"Branch Circuit Current Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEC
"Branch Circuit Apparent Load Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEB
"Branch Circuit Apparent Load Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEA
"Branch Circuit Apparent Load Phase A"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_HOLE_DEFINITION
"Hole Definition"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_PARAM
"Feed Through Lugs"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_CIRCUIT_NUMBERING_TYPE
"Circuit Numbering Option"

Autodesk.Revit.DB.BuiltInParameter.TAG_ON_PLACEMENT_UI
"Tag on Placement"

Autodesk.Revit.DB.BuiltInParameter.ROUTE_ANALYSIS_SETTINGS_PARAM
"Route Analysis Settings"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_VIEW_NAME
"View Name"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_LEVEL_NAME
"Level"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_CONNECTION_OVERRIDE_TYPE
"Override by Instance"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_CONNECTION_EDIT_TYPE
"Modify Parameters"

Autodesk.Revit.DB.BuiltInParameter.PATH_OF_TRAVEL_TIME
"Time"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_HOLE_ALPHA
"Taper Angle"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_HOLE_DEPTH
"Hole Depth"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_HOLE_SLOT_LENGTH
"Length of the slot"

Autodesk.Revit.DB.BuiltInParameter.DIRECTCONTEXT3D_LOADED
"Loaded"

Autodesk.Revit.DB.BuiltInParameter.REBAR_INTERNAL_MULTIPLANAR_ARC_CONNECTOR
"INTERNAL: Multiplanar Arc Connector"

Autodesk.Revit.DB.BuiltInParameter.FAMILY_FREEINST_DEFAULT_ELEVATION
"Default Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_AREA
"Area"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOADS_IN_SET
"Loads in Set"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_SET_ON_STANDBY
"Quantity on Standby"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_SET_ON_DUTY
"Quantity of Prime"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DISTRIBUTION_NODE_LOAD_SET
"Load Set"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DISTRIBUTION_NODE_SUPPLY_TO
"Supply To"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_FEEDER_LENGTH
"Length"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LEVEL_ID
"Level"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_POWER_DENSITY
"Apparent Power Density"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DISTRIBUTION_NODE_SUPPLY_FROM2
"Supply From 2"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DISTRIBUTION_NODE_SUPPLY_FROM
"Supply From"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DISTRIBUTION_NODE_SUPPLY_FROM1
"Supply From 1"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_SET_ON_TOTAL
"Total Quantity"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_NAME_PARAM
"Name"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_TYPE_PARAM
"Load Type"

Autodesk.Revit.DB.BuiltInParameter.RBS_AREA_BASED_LOAD_TYPE
"Area Based Load Type"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_LOAD_DENSITY
"Power Density"

Autodesk.Revit.DB.BuiltInParameter.MEP_ELEC_ZONE_EQUIPMENT_TYPE
"Equipment Type"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_EQUIPMENT_DRAW_VENTILATION
"Draw Ventilation"

Autodesk.Revit.DB.BuiltInParameter.MEP_VRF_LOOP
"Variable Refrigerant Flow Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_REHEAT_HOTWATER_LOOP
"Reheat Hot Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_EQUIPMENT
"Zone Equipment"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_EQUIPMENT_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_HOTWATER_LOOP
"Heating Hot Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_AIR_LOOP
"Air System"

Autodesk.Revit.DB.BuiltInParameter.MEP_REHEAT_COIL_TYPE
"Reheat Coil"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_EQUIPMENT_BEHAVIOR
"Behavior"

Autodesk.Revit.DB.BuiltInParameter.MEP_ZONE_EQUIPMENT_TYPE
"Equipment Type"

Autodesk.Revit.DB.BuiltInParameter.MEP_AIRLOOP_FANTYPE
"Fan"

Autodesk.Revit.DB.BuiltInParameter.MEP_CHILLED_WATER_LOOP
"Chilled Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_COOLING_COIL_TYPE
"Cooling Coil"

Autodesk.Revit.DB.BuiltInParameter.MEP_HEATING_HOTWATER_LOOP
"Heating Hot Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_HEATING_COIL_TYPE
"Heating Coil"

Autodesk.Revit.DB.BuiltInParameter.MEP_PREHEAT_HOTWATER_LOOP
"Preheat Hot Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_AIRLOOP_PREHEAT_COILTYPE
"Preheat Coil"

Autodesk.Revit.DB.BuiltInParameter.MEP_AIRLOOP_HEATEXCHANGER_TYPE
"Heat Exchanger"

Autodesk.Revit.DB.BuiltInParameter.MEP_CONDENSER_WATER_LOOP
"Condenser Water Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_WATERLOOP_CHILLERTYPE
"Chiller Type"

Autodesk.Revit.DB.BuiltInParameter.MEP_WATERLOOP_TYPE
"Loop Type"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_LOOP_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_ELEC_CURRENT
"Current"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_ELEC_VOLTAGE
"Voltage"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_ELEC_CURRENT_RATING
"Current Rating"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_CONNECTION_MODIFY_CONNECTION_PARAMETERS
"Detailed Parameters"

Autodesk.Revit.DB.BuiltInParameter.RBS_ENERGY_ANALYSIS_BUILDING_ENVELOPE_ANALYTICAL_SURFACE_IDENTIFICATION_RESOLUTION
"Analytical Surface Resolution"

Autodesk.Revit.DB.BuiltInParameter.RBS_ENERGY_ANALYSIS_BUILDING_ENVELOPE_ANALYTICAL_SPACE_IDENTIFICATION_RESOLUTION
"Analytical Space Resolution"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_SPACE_BOUNDING_PARAM
"Analytical Space Bounding"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_HORIZONTAL_VOID_THRESHOLD
"Horizontal Void/Chase Area Threshold"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_VERTICAL_VOID_THRESHOLD
"Average Vertical Void Height Threshold"

Autodesk.Revit.DB.BuiltInParameter.RBS_PIPE_WALL_THICKNESS
"Wall Thickness"

Autodesk.Revit.DB.BuiltInParameter.MEP_PIPE_LOWER_INVERT_ELEVATION
"Lower End Invert Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_PIPE_UPPER_INVERT_ELEVATION
"Upper End Invert Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_PIPE_LOWER_OBVERT_ELEVATION
"Lower End Obvert Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_PIPE_UPPER_OBVERT_ELEVATION
"Upper End Obvert Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_LOWER_BOTTOM_ELEVATION_INCLUDE_INSULATION
"Lower End Bottom of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_LOWER_TOP_ELEVATION_INCLUDE_INSULATION
"Lower End Top of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_UPPER_BOTTOM_ELEVATION_INCLUDE_INSULATION
"Upper End Bottom of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_UPPER_TOP_ELEVATION_INCLUDE_INSULATION
"Upper End Top of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_LOWER_BOTTOM_ELEVATION
"Lower End Bottom Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_LOWER_TOP_ELEVATION
"Lower End Top Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_UPPER_BOTTOM_ELEVATION
"Upper End Bottom Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_UPPER_TOP_ELEVATION
"Upper End Top Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_LOWER_CENTERLINE_ELEVATION
"Lower End Centerline Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_UPPER_CENTERLINE_ELEVATION
"Upper End Centerline Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_DUCTWORK_STIFFENER_SPEC
"Stiffener Specification"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PART_PAT_NO
"Part Pattern Number"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_BRANCH_SIZE
"Size of Primary Branch End"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_SECONDARY_SIZE
"Size of Secondary End"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PRIMARY_SIZE
"Size of Primary End"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_PIPE_INVERT_ELEVATION
"Pipe Invert Elevation": This parameter is obsolete. It exists only for compatibility.

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_CENTERLINE_ELEVATION_OF_PART
"Spot Centerline Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.MEP_SPOT_CENTERLINE_ELEVATION
"Spot Centerline Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_SPOT_BOTTOM_ELEVATION_INCLUDE_INSULATION_OF_PART
"Spot Bottom of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_SPOT_BOTTOM_ELEVATION_INCLUDE_INSULATION
"Spot Bottom of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_SPOT_BOTTOM_ELEVATION_OF_PART
"Spot Bottom Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.MEP_SPOT_BOTTOM_ELEVATION
"Spot Bottom Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_SPOT_TOP_ELEVATION_INCLUDE_INSULATION_OF_PART
"Spot Top of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.MEP_SPOT_TOP_ELEVATION_INCLUDE_INSULATION
"Spot Top of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_SPOT_TOP_ELEVATION_OF_PART
"Spot Top Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.MEP_SPOT_TOP_ELEVATION
"Spot Top Elevation": used for both design and fabrication components

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_END_OFFSET_PARAM
"End Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_START_OFFSET_PARAM
"Start Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_BOTTOM_OF_PART
"Lower End Bottom of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_TOP_OF_PART
"Upper End Top of Insulation Elevation"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_OFFSET_PARAM
"Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.PHY_MATERIAL_PARAM_SHEAR_PERPENDICULAR
"Shear perpendicular to grain"

Autodesk.Revit.DB.BuiltInParameter.PIPE_VELOCITY_PRESSURE
"Velocity Pressure"

Autodesk.Revit.DB.BuiltInParameter.RBS_DUCT_BOTTOM_ELEVATION
"Lower End Bottom Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_DUCT_TOP_ELEVATION
"Upper End Top Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_PIPE_INVERT_ELEVATION
"Invert Elevation": This parameter is obsolete. It exists only for compatibility.

Autodesk.Revit.DB.BuiltInParameter.RELATIVE_ROUGHNESS
"Relative Roughness"

Autodesk.Revit.DB.BuiltInParameter.FRICTION_FACTOR
"Friction Factor"

Autodesk.Revit.DB.BuiltInParameter.PIPE_ROUGHNESS
"Roughness"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_CIRCUIT_SLOT_INDEX
"Slot Index"

Autodesk.Revit.DB.BuiltInParameter.CIRCUIT_WAYS_PARAM
"Ways"

Autodesk.Revit.DB.BuiltInParameter.CIRCUIT_LOAD_CLASSIFICATION_ABBREVIATION_PARAM
"Load Classification Abbreviation"

Autodesk.Revit.DB.BuiltInParameter.CIRCUIT_PHASE_PARAM
"Phase Label"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_CIRCUIT_NAMING_INDEX
"Circuit Naming Index"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_CIRCUIT_CONNECTION_TYPE_PARAM
"Connection Type"

Autodesk.Revit.DB.BuiltInParameter.RBS_CTC_BOTTOM_ELEVATION
"Lower End Bottom Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_CTC_TOP_ELEVATION
"Upper End Top Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_MAX_POLE_BREAKERS
"Max Number of Single Pole Breakers"

Autodesk.Revit.DB.BuiltInParameter.STRUCTURAL_CONNECTION_EDIT_RANGES_OF_APPLICABILITY
"Modify Ranges of applicability"

Autodesk.Revit.DB.BuiltInParameter.SPACE_COMPOSEDNAME_PARAM
"Composed Name"

Autodesk.Revit.DB.BuiltInParameter.SPACE_NUMBER_PARAM
"Number"

Autodesk.Revit.DB.BuiltInParameter.CONSTRUCTION_IS_SCHEMATIC
"Schematic"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ZONE_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.ZONE_DESIGN_COOL_TEMPERATURE
"Design Temperature for Cooling"

Autodesk.Revit.DB.BuiltInParameter.ZONE_DESIGN_HEAT_TEMPERATURE
"Design Temperature for Heating"

Autodesk.Revit.DB.BuiltInParameter.ZONE_OUTSIDE_AIR_FLOW_PER_PERSON
"Outside Air Flow per Person"

Autodesk.Revit.DB.BuiltInParameter.ZONE_OUTSIDE_AIR_FLOW_PER_AREA
"Outside Air Flow per Area"

Autodesk.Revit.DB.BuiltInParameter.ZONE_AIR_CHANGES_PER_HOUR
"Air Changes per Hour"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ZONE
"Analytical Zone"

Autodesk.Revit.DB.BuiltInParameter.SPACE_NUMBER_OF_PEOPLE
"Number of People"

Autodesk.Revit.DB.BuiltInParameter.SPACE_CONDITION_TYPE
"Condition Type"

Autodesk.Revit.DB.BuiltInParameter.SPACE_TYPE_GBXML
"Space Type (gbXML)"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_SURFACE
"Analytical Surface"

Autodesk.Revit.DB.BuiltInParameter.SURFACE_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.ORIGINATING_ELEMENT_NAME
"Originating Element"

Autodesk.Revit.DB.BuiltInParameter.WINDOW_TYPE_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.CONSTRUCTION_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.ANALYTIC_CONSTRUCTION
"Analytic Construction"

Autodesk.Revit.DB.BuiltInParameter.TILT
"Tilt"

Autodesk.Revit.DB.BuiltInParameter.AZIMUTH
"Azimuth"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ADJACENT_SPACE
"Adjacent Analytical Space"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_SPACE
"Analytical Space"

Autodesk.Revit.DB.BuiltInParameter.SPACE_NAME_PARAM
"Name"

Autodesk.Revit.DB.BuiltInParameter.SYSTEMS_ANALYSIS_REPORT_FOLDER
"Reports Folder Path"

Autodesk.Revit.DB.BuiltInParameter.SYSTEMS_ANALYSIS_REPORT_STYLE
"Report Style"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_PROJECT_PHASE
"Phase"

Autodesk.Revit.DB.BuiltInParameter.SPACE_VOLUME
"Volume"

Autodesk.Revit.DB.BuiltInParameter.SPACE_AREA
"Area"

Autodesk.Revit.DB.BuiltInParameter.PEAK_LATENT_COOLING_LOAD
"Peak Latent Cooling Load"

Autodesk.Revit.DB.BuiltInParameter.PEAK_AIRFLOW_PARAM
"Peak Airflow"

Autodesk.Revit.DB.BuiltInParameter.SPACE_REFERENCE_LEVEL_PARAM
"Reference Level"

Autodesk.Revit.DB.BuiltInParameter.SPACE_INFILTRATION_AIRFLOW
"Infiltration Airflow"

Autodesk.Revit.DB.BuiltInParameter.SPACE_INFILTRATION_AIRFLOW_PER_AREA
"Infiltration Airflow per area"

Autodesk.Revit.DB.BuiltInParameter.SPACE_OUTDOOR_AIRFLOW
"Outdoor Airflow"

Autodesk.Revit.DB.BuiltInParameter.SPACE_OUTDOOR_AIRFLOW_PER_PERSON
"Outdoor Airflow per person"

Autodesk.Revit.DB.BuiltInParameter.SPACE_OUTDOOR_AIRFLOW_PER_AREA
"Outdoor Airflow per area"

Autodesk.Revit.DB.BuiltInParameter.SPACE_AIR_CHANGES_PER_HOUR
"Air Changes per Hour"

Autodesk.Revit.DB.BuiltInParameter.SPACE_POWER_LOAD_PARAM
"Power Load"

Autodesk.Revit.DB.BuiltInParameter.SPACE_LIGHTING_LOAD_PARAM
"Lighting Load"

Autodesk.Revit.DB.BuiltInParameter.SPACE_PEOPLE_LOAD_PARAM
"Occupancy Load"

Autodesk.Revit.DB.BuiltInParameter.SPACE_POWER_LOAD_PER_AREA_PARAM
"Power Load per area"

Autodesk.Revit.DB.BuiltInParameter.SPACE_LIGHTING_LOAD_PER_AREA_PARAM
"Lighting Load per area"

Autodesk.Revit.DB.BuiltInParameter.SPACE_PEOPLE_LATENT_HEAT_GAIN_PER_PERSON_PARAM
"Latent Heat Gain per person"

Autodesk.Revit.DB.BuiltInParameter.SPACE_PEOPLE_SENSIBLE_HEAT_GAIN_PER_PERSON_PARAM
"Sensible Heat Gain per person"

Autodesk.Revit.DB.BuiltInParameter.SPACE_AREA_PER_PERSON_PARAM
"Area per person"

Autodesk.Revit.DB.BuiltInParameter.SPACE_AIRFLOW_PER_AREA_PARAM
"Airflow per area"

Autodesk.Revit.DB.BuiltInParameter.PEAK_COOLING_LOAD_PARAM
"Peak Cooling Load"

Autodesk.Revit.DB.BuiltInParameter.PEAK_HEATING_LOAD_PARAM
"Peak Heating Load"

Autodesk.Revit.DB.BuiltInParameter.SPACE_DEHUMIDIFICATION_SET_POINT
"Dehumidification Set Point"

Autodesk.Revit.DB.BuiltInParameter.SPACE_HUMIDIFICATION_SET_POINT
"Humidification Set Point"

Autodesk.Revit.DB.BuiltInParameter.SPACE_COOLING_SET_POINT
"Cooling Set Point"

Autodesk.Revit.DB.BuiltInParameter.SPACE_HEATING_SET_POINT
"Heating Set Point"

Autodesk.Revit.DB.BuiltInParameter.ZONE_LEVEL_OFFSET_TOP
"Top Offset"

Autodesk.Revit.DB.BuiltInParameter.ZONE_LEVEL_OFFSET
"Level Offset"

Autodesk.Revit.DB.BuiltInParameter.SYSTEM_ZONE_LEVEL_ID
"Level"

Autodesk.Revit.DB.BuiltInParameter.SPACE_INFILTRATION_PARAM
"Infiltration Airflow per area"

Autodesk.Revit.DB.BuiltInParameter.RBS_OFFSET_PARAM
"Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.DUCT_ROUGHNESS
"Roughness"

Autodesk.Revit.DB.BuiltInParameter.RBS_END_OFFSET_PARAM
"End Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.RBS_START_OFFSET_PARAM
"Start Middle Elevation"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_SET_END_STATION
"Alignment Label Set End Station"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_SET_START_STATION
"Alignment Label Set Start Station"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_SET_INTERVAL
"Alignment Station Label Set Interval": The text is not used directly anywhere in the UI,
instead the XAML specifies its own string for the value's label.

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_SET_OFFSET
"Alignment Station Label Set Offset": The text is not used directly anywhere in the UI,
instead the XAML specifies its own string for the value's label.

Autodesk.Revit.DB.BuiltInParameter.WALL_TAPERED_WIDTH_AT_BOTTOM
"Bottom Width"

Autodesk.Revit.DB.BuiltInParameter.WALL_TAPERED_WIDTH_AT_TOP
"Top Width"

Autodesk.Revit.DB.BuiltInParameter.WALL_TAPERED_USE_INSTANCE_ANGLES
"Enable Angle Overrides"

Autodesk.Revit.DB.BuiltInParameter.WALL_TYPE_WIDTH_MEASURED_AT
"Width Measured At"

Autodesk.Revit.DB.BuiltInParameter.WALL_TYPE_DEFAULT_TAPERED_INTERIOR_INWARD_ANGLE
"Default Interior Angle"

Autodesk.Revit.DB.BuiltInParameter.WALL_TYPE_DEFAULT_TAPERED_EXTERIOR_INWARD_ANGLE
"Default Exterior Angle"

Autodesk.Revit.DB.BuiltInParameter.WALL_TAPERED_INTERIOR_INWARD_ANGLE
"Interior Angle"

Autodesk.Revit.DB.BuiltInParameter.WALL_TAPERED_EXTERIOR_INWARD_ANGLE
"Exterior Angle"

Autodesk.Revit.DB.BuiltInParameter.WALL_SINGLE_SLANT_ANGLE_FROM_VERTICAL
"Angle From Vertical"

Autodesk.Revit.DB.BuiltInParameter.WALL_CROSS_SECTION
"Cross-Section"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_PREDEFINEDTYPE_TYPE
"Type IFC Predefined Type"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_PREDEFINEDTYPE
"IFC Predefined Type"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_ELEMENT_TYPE_AS
"Export Type to IFC As"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_ELEMENT_AS
"Export to IFC As"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_ELEMENT_TYPE
"Export Type to IFC"

Autodesk.Revit.DB.BuiltInParameter.IFC_EXPORT_ELEMENT
"Export to IFC"

Autodesk.Revit.DB.BuiltInParameter.IFC_ORGANIZATION
"IfcOrganization"

Autodesk.Revit.DB.BuiltInParameter.IFC_APPLICATION_VERSION
"IfcApplicationVersion"

Autodesk.Revit.DB.BuiltInParameter.IFC_APPLICATION_NAME
"IfcApplicationName"

Autodesk.Revit.DB.BuiltInParameter.ENERGY_ANALYSIS_CURRENT_VIEW_ONLY
"Use Only Elements Visible In Current View"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_NODE_CONNECTION_STATUS
"Connection Status"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_MEMBER_ROTATION
"Cross-Section Rotation": Used for Analytical Member

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_PANEL_THICKNESS
"Thickness": Used for Analytical Panel

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ELEMENT_STRUCTURAL_ROLE
"Structural Role": Used for Analytical Elements

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ELEMENT_PHYSICAL_ASSET
"Physical Material Asset": Used for Analytical Elements.

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_ELEMENT_HAS_ASSOCIATION
"Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation

Autodesk.Revit.DB.BuiltInParameter.GRID_NET_LOCATION_MARK
"Location Mark": Provides grid system association information

Autodesk.Revit.DB.BuiltInParameter.FAMILY_ENABLE_CUTTING_IN_VIEWS
"Enable Cutting in Views"

Autodesk.Revit.DB.BuiltInParameter.FAMILY_ROTATE_TEXT_WITH_COMPONENT
"Rotate text with component"

Autodesk.Revit.DB.BuiltInParameter.TOPOSURFACE_CONTOUR_SUBCATEGORY_ID
"Subcategory"

Autodesk.Revit.DB.BuiltInParameter.ORIENT_BY_VIEW
"Rotate With Text"

Autodesk.Revit.DB.BuiltInParameter.VOLUME_OF_INTEREST_HEIGHT
"Height"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_MEMBER_SECTION_TYPE
"Section Type": The id of the type from the structural Family assigned to the analytical member.

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_MODEL_END_PROJECTION_ORTHOGONAL
"End Projection Orthogonal"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_MODEL_START_PROJECTION_ORTHOGONAL
"Start Projection Orthogonal"

Autodesk.Revit.DB.BuiltInParameter.CURVE_IS_MULTILEVEL
"Multilevel Boundary"

Autodesk.Revit.DB.BuiltInParameter.CURVE_BASE_LEVEL
"Bottom Level"

Autodesk.Revit.DB.BuiltInParameter.CURVE_BOTTOM_LEVEL
"Bottom Level"

Autodesk.Revit.DB.BuiltInParameter.CURVE_TOP_LEVEL
"Top Level"

Autodesk.Revit.DB.BuiltInParameter.RASTER_SYMBOL_LINKLOAD_STATUS
"Link Status"

Autodesk.Revit.DB.BuiltInParameter.RASTER_ENABLE_SNAPS
"Enable Snaps"

Autodesk.Revit.DB.BuiltInParameter.RASTER_SYMBOL_PAGENUMBER
"Page Number"

Autodesk.Revit.DB.BuiltInParameter.RASTER_LOCK_PROPORTIONS
"Lock Proportions"

Autodesk.Revit.DB.BuiltInParameter.RVT_LINK_INSTANCE_PROJECT_INFORMATION
"Project Information"

Autodesk.Revit.DB.BuiltInParameter.IMPORT_INSTANCE_CUTTING_IN_VIEW
"Enable Cutting in Views"

Autodesk.Revit.DB.BuiltInParameter.IMPORT_BASE_LEVEL_OFFSET
"Offset from Work Plane"

Autodesk.Revit.DB.BuiltInParameter.IMPORT_BASE_LEVEL
"Work Plane"

Autodesk.Revit.DB.BuiltInParameter.TAG_ELEVATION_BASE
"Elevation Base"

Autodesk.Revit.DB.BuiltInParameter.TAG_ELEMENT_COUNT
"Host Count"

Autodesk.Revit.DB.BuiltInParameter.TAG_ANGLE_PARAM
"Angle"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_STATION_VALUE
"Station Value"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_IND_STATION
"Station Indicator"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_INCLUDE_STATION
"Include Station"

Autodesk.Revit.DB.BuiltInParameter.SPOT_DIM_LEADER_LINE
"Leader Line"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_LABEL_DISTANCE
"Distance": Currently not in use

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_SUFFIX
"Station Suffix"

Autodesk.Revit.DB.BuiltInParameter.ALIGNMENT_STATION_PREFIX
"Station Prefix"

Autodesk.Revit.DB.BuiltInParameter.DIM_SUFFIX
"Dimension Suffix"

Autodesk.Revit.DB.BuiltInParameter.DIM_PREFIX
"Dimension Prefix"

Autodesk.Revit.DB.BuiltInParameter.ARROW_CENTERED
"Tick Mark Centered"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_ELEVATION_SUFFIX
"Elevation Suffix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_ELEVATION_PREFIX
"Elevation Prefix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_BOTTOM_SUFFIX
"Bottom Coordinate Suffix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_BOTTOM_PREFIX
"Bottom Coordinate Prefix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_TOP_SUFFIX
"Top Coordinate Suffix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_TOP_PREFIX
"Top Coordinate Prefix"

Autodesk.Revit.DB.BuiltInParameter.SPOT_COORDINATE_BASE
"Coordinate Base"

Autodesk.Revit.DB.BuiltInParameter.SPOT_ELEV_BOT_VALUE
"Bottom Coordinate"

Autodesk.Revit.DB.BuiltInParameter.SPOT_ELEV_TOP_VALUE
"Top Coordinate"

Autodesk.Revit.DB.BuiltInParameter.SPOT_ELEV_BASE
"Elevation Base"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_DEFINE_THERMAL_PROPERTIES_BY
"Define Thermal Properties by"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_THERMAL_MASS
"Thermal Mass"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_LIGHTING_ALTITUDE_TEXT
"Lighting altitude text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_LIGHTING_ALTITUDE_VALUE
"Lighting altitude"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_LIGHTING_AZIMUTH_TEXT
"Lighting azimuth text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_LIGHTING_AZIMUTH_VALUE
"Lighting azimuth"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_MULTIDAY_DATETIME_TEXT
"Multi-day date and time text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_MULTIDAY_FRAME_TEXT
"Multi-day frame text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_MULTIDAY_FRAME_VALUE
"Multi-day frame"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SINGLEDAY_DATETIME_TEXT
"Single day date and time text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SINGLEDAY_FRAME_TEXT
"Single day frame text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SINGLEDAY_FRAME_VALUE
"Single day frame"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_STILL_TIME_TEXT
"Still time text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_STILL_TIME_VALUE
"Still time"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_STILL_DATE_TEXT
"Still date text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_STILL_DATE_VALUE
"Still date"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_LIGHTING_PRESET_INDEX
"Lighting presets combo"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_MULTIDAY_PRESET_INDEX
"Multi-day presets combo"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SINGLEDAY_PRESET_INDEX
"Single day presets combo"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_STILL_PRESET_INDEX
"Still presets combo"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SHADOWS_INTENSITY_TEXT
"Shadows intensity text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SHADOWS_INTENSITY_VALUE
"Shadows intensity"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SUN_INTENSITY_TEXT
"Sun intensity text"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_SUN_INTENSITY_VALUE
"Sun intensity"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_ANIMATION_SPEED_TEXT
"Loop animation speed"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_ANIMATION_SPEED_VALUE
"Loop animation speed"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_IS_LIGHTING_STUDY_TYPE
"Lighting study"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_IS_MULTIDAY_STUDY_TYPE
"Multi-day study"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_IS_SINGLEDAY_STUDY_TYPE
"Single day study"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_IS_STILLIMAGE_STUDY_TYPE
"Still image study"

Autodesk.Revit.DB.BuiltInParameter.VIEW_SOLARSTUDY_CURRENT_STUDY_TYPE_INDEX
"Study type"

Autodesk.Revit.DB.BuiltInParameter.VIEWPORT_ATTR_PRESERVE_TITLE_POSITION
"Preserve Title Position"

Autodesk.Revit.DB.BuiltInParameter.VIEWPORT_POSITIONING
"Viewport Positioning"

Autodesk.Revit.DB.BuiltInParameter.VIEWPORT_VIEW
"View"

Autodesk.Revit.DB.BuiltInParameter.ASSOCIATED_LEVEL_OFFSET
"Associated Level Offset": The offset from the associated level.

Autodesk.Revit.DB.BuiltInParameter.ASSOCIATED_LEVEL
"Associated Level": The level associated with this cell.

Autodesk.Revit.DB.BuiltInParameter.SELECTION_EDITABLE_ONLY
"Editable only"

Autodesk.Revit.DB.BuiltInParameter.INSERT_ORIENTATION
"Orientation"

Autodesk.Revit.DB.BuiltInParameter.WALL_SWEEP_ORIENTATION
"Orientation"

Autodesk.Revit.DB.BuiltInParameter.INSTANCE_FREE_HOST_OFFSET_PARAM
"Offset from Host"

Autodesk.Revit.DB.BuiltInParameter.INSTANCE_ELEVATION_PARAM
"Elevation from Level"

Autodesk.Revit.DB.BuiltInParameter.DOOR_EVACUATION_EXIT_TYPE
"Exit Access"